/**
 * ============================================================================
 * 泪心开源驱动 - TearGame Open Source Driver (雷电 4.4.146 进程基址模块头文件)
 * ============================================================================
 */

#ifndef _PROCESS_H_
#define _PROCESS_H_

#include <linux/kernel.h>
#include <linux/types.h>

/* 
 * ============================================================================
 * 声明对外的获取进程模块基址业务接口
 * ============================================================================
 */
uintptr_t get_module_base(pid_t pid, char *name);

#endif /* _PROCESS_H_ */
